Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh11-v3.tmx
Source language: bo
Languages: en

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དེ་ཡང་རང་བཞིན་གྱིས་སྟོང་པ་ཉིད་ཀྱི་སླད་དུ་ཡོངས་སུ་གཟུང་བ་མ་མཆིས་པ་ལགས་སོ། །
en: The transcendent perfection of wisdom also cannot be appropriated, on account of the emptiness of its inherent existence.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་དེ་ལྟར་སྤྱོད་པས། ཆོས་ཐམས་ཅད་རང་བཞིན་གྱིས་སྟོང་པར་ཉེ་བར་བརྟག་པར་བགྱི་སྟེ།
en: “Great bodhisattva beings who practice the transcendent perfection of wisdom in that manner should determine that all things are empty of inherent existence.

source: ཅི་ནས་ཀྱང་ཆོས་གང་ལ་ཡང་ཡིད་རྣམ་པར་རྒྱུ་བར་མི་འགྱུར་བ་དེ་ལྟར་ཉེ་བར་བརྟག་པར་བགྱི་སྟེ།
en: They should determine that there is no mental wandering whatsoever, with respect to anything.

source: དེ་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཡོངས་སུ་གཟུང་བ་མ་མཆིས་པའི་ཏིང་ངེ་འཛིན་གྱི་དཀྱིལ་འཁོར་གྱི་ཡོ་བྱད་ཡངས་པ། ཚད་མ་མཆིས་པ་ཚད་མ་ངེས་པ་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཐམས་ཅད་དང་ཐུན་མོང་མ་ལགས་པའོ། །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དེ་ཡང་ནང་སྟོང་པ་ཉིད་ཀྱི་སླད་དུ་དང་། ཕྱི་སྟོང་པ་ཉིད་ཀྱི་སླད་དུ་དང་། དེ་བཞིན་དུ་ཕྱི་ནང་སྟོང་པ་ཉིད་ཀྱི་སླད་དུ་དང་། སྟོང་པ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་སླད་དུ་དང་། ཆེན་པོ་སྟོང་པ་ཉིད་དང་། དོན་དམ་པ་སྟོང་པ་ཉིད་དང་། འདུས་བྱས་སྟོང་པ་ཉིད་དང་། འདུས་མ་བྱས་སྟོང་པ་ཉིད་དང་། མཐའ་ལས་འདས་པ་སྟོང་པ་ཉིད་དང་། ཐོག་མ་དང་ཐ་མ་མེད་པ་སྟོང་པ་ཉིད་དང་། དོར་བ་མེད་པ་སྟོང་པ་ཉིད་དང་། རང་བཞིན་གྱིས་སྟོང་པ་ཉིད་དང་། རང་གི་མཚན་ཉིད་སྟོང་པ་ཉིད་དང་།
en: This is the spacious, immeasurable, and indefinable method of great bodhisattva beings, known as the maṇḍala of the meditative stability of non-appropriation, which is not shared in common with all the śrāvakas and pratyekabuddhas.

source: ཆོས་ཐམས་ཅད་སྟོང་པ་ཉིད་དང་། མི་དམིགས་པ་སྟོང་པ་ཉིད་དང་། དངོས་པོ་མེད་པ་སྟོང་པ་ཉིད་དང་། ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་དང་། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་སླད་དུ་ཡོངས་སུ་གཟུང་བ་མ་མཆིས་པ་ལགས་སོ། །
en: “Omniscience, also, cannot be appropriated, on account of the emptiness of internal phenomena, on account of the emptiness of external phenomena, and similarly, on account of the emptiness of both external and internal phenomena, and on account of the emptiness of emptiness, the emptiness of great extent, the emptiness of ultimate reality, the emptiness of conditioned phenomena, the emptiness of unconditioned phenomena, the emptiness of the unlimited, the emptiness of that which has neither beginning nor end, the emptiness of that which is not be to abandoned, the emptiness of inherent existence, the emptiness of all intrinsic defining characteristics, the emptiness of all things, the emptiness of non-apprehension, the emptiness of non-entities, the emptiness of essential nature, and the emptiness of the essential nature of non-entities.

source: དེ་ཅིའི་སླད་དུ་ཞེ་ན། དེ་ནི་མཚན་མས་བསྒྲུབ་པར་བགྱི་བ་མ་ལགས་པའི་སླད་དུའོ། །
en: If one were to ask why, it is because this omniscience cannot be acquired by means of indications.

source: དེ་ཅིའི་སླད་དུ་ཞེ་ན། མཚན་མ་ནི་ཉོན་མོངས་པ་ལགས་པའི་སླད་དུའོ། །
en: If one were to ask why, it is because indications are afflictive.

source: མཚན་མ་ཡང་གང་ལགས་ཤེ་ན།
en: “What, one might ask, constitute those indications?

source: འདི་ལྟ་སྟེ་གཟུགས་ནི་མཚན་མ་ལགས་སོ། །
en: Indications include sights.

source: སྒྲ་དང་། དྲི་དང་། རོ་དང་རེག་བྱ་དང་། ཆོས་ནི་མཚན་མ་ལགས་སོ། །
en: Indications include sounds, odors, tastes, tangibles and mental phenomena.

source: དེ་བཞིན་དུ་སྦྱར་ཏེ། གཟུངས་ཀྱི་སྒོ་རྣམས་ནི་མཚན་མ་ལགས་སོ། །
en: In the same vein, the dhāraṇī gateways are indications.

source: ཏིང་ངེ་འཛིན་གྱི་སྒོ་རྣམས་ཀྱི་བར་དུ་ནི་མཚན་མ་ལགས་ཏེ།
en: [other meditative experiences], up to and including the gateways of meditative stability, are indications.

source: དེ་ནི་མཚན་མ་ཞེས་བགྱིའོ། །
en: These are called indications.

source: ཉོན་མོངས་པ་ཡང་དེ་ལགས་ཏེ་དེ་ནི་གཟུང་བར་མི་བགྱི།
en: They are also afflictive, and they should not be acquired.

source: གོམས་པར་མི་བགྱི་ལགས་སོ། །
en: They should not be experienced.

source: དེ་ལྟ་མ་ལགས་ན་ནི་ཀུན་ཏུ་རྒྱུ་བཟོ་སྦྱངས་ཀྱང་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་འདི་ལ་དད་པར་མི་འགྱུར་ལགས་སོ། །
en: Otherwise, the wandering mendicant Śreṇika also would not have gained faith in this omniscient pristine cognition.

source: དད་པ་དེ་ཡང་གང་ཞེ་ན། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་འདི་ལ་ཡིད་ཆེས་པ་དང་།
en: “What you may ask, is faith?

source: རྟོག་པ་དང་མོས་པ་དང་རྟེན་པ་དང་སེམས་པ་དང་འཇལ་བ་དང་དཔྱོད་པ་སྟེ། དེ་ཡང་མཚན་མའི་ཚུལ་དུ་མ་ལགས་ཏེ།
en: It implies conviction, ideation, volition, reliance, attention, appraisal and scrutiny—all without any kind of sign or indication.

source: དེ་ལྟར་ན་མཚན་མ་དེ་གཟུང་བར་མི་བགྱི་ལགས་སོ། །
en: Therefore, indications should not be acquired.

source: ཀུན་ཏུ་རྒྱུ་བཟོ་སྦྱངས་ཀྱང་མོས་ནས་དད་པས་རྗེས་སུ་འབྲང་ཞིང་རང་བཞིན་གྱིས་སྟོང་པ་ཉིད་དུ་ཤེས་པས་ཞུགས་ནས།
en: The wandering mendicant Śreṇika indeed became a follower [of the Great Vehicle] endowed with faith, owing to the power of his volition, and he subsequently entered into it by understanding the emptiness of inherent existence.

source: གཟུགས་ཡོངས་སུ་མ་བཟུང་། ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་རྣམས་དང་། རྣམ་པར་ཤེས་པ་མཚན་མར་ཡོངས་སུ་མ་བཟུང་བ་ལགས་སོ། །
en: He did not appropriate physical forms, nor did he appropriate feelings, perceptions, formative predispositions, or consciousness in the manner of indications.

source: དེ་ཅིའི་སླད་དུ་ཞེ་ན། འདི་ལྟར་དེ་ལ་རང་གི་མཚན་ཉིད་ཀྱིས་སྟོང་པའི་ཆོས་རྣམས་ལ་ཡོངས་སུ་གཟུང་བ་མི་སྐྱེ་བའི་སླད་དུའོ། །
en: If one were to ask why, it is because the appropriation of all things, which are empty of their own defining characteristics, did not arise.

source: དེ་ཅིའི་སླད་དུ་ཞེ་ན། འདི་ལྟར་དེས་ཤེས་པ་དེ་ནང་གི་མངོན་པར་རྟོགས་པ་ཐོབ་པས་ཡང་དག་པར་རྗེས་སུ་མ་མཐོང་།
en: Again, if one were to ask why, it is because he did not consider that understanding to be due to the attainment of clear realization of internal phenomena.

source: ཕྱིའི་མངོན་པར་རྟོགས་པ་ཐོབ་པ་དང་། ཕྱི་ནང་གི་མངོན་པར་རྟོགས་པ་ཐོབ་པས་ཤེས་པ་དེ་ཡང་དག་པར་རྗེས་སུ་མ་མཐོང་ལ།
en: Nor did he consider that understanding to be due to the attainment of clear realization of external phenomena, or due to the attainment of clear realization of both external and internal phenomena.

source: ནང་སྟོང་པ་ཉིད་ཀྱི་སླད་དུ་ཤེས་པ་དེ་ཤེས་པ་དང་། མངོན་པར་རྟོགས་པ་ལས་གཞན་དུ་ཡང་དག་པར་རྗེས་སུ་མ་མཐོང་བའི་སླད་དུའོ། །
en: Nor, on account of the emptiness of internal phenomena, did he consider that understanding to be anything other than clear realization.

source: དེ་ཅིའི་སླད་དུ་ཞེ་ན། འདི་ལྟར་དེས་གང་གིས་ཤེས་པར་བགྱིད་པ་དང་། གང་ཤེས་པར་བགྱིད་པ་དང་། གང་ལས་ཤེས་པར་བགྱི་བའི་ཆོས་དེ་ཡང་དག་པར་རྗེས་སུ་མ་མཐོང་སྟེ།
en: “If one were to ask why, it is because he did not consider anything which could engender that understanding, any understanding that could be engendered, or anything from which that understanding could be engendered.

source: ཤེས་པ་དེ་གཟུགས་ནས་ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་རྣམས་དང་། རྣམ་པར་ཤེས་པའི་བར་གྱི་ནང་དུ་ཡང་དག་པར་རྗེས་སུ་མ་མཐོང་།
en: He did not consider that understanding to be inside physical forms, nor inside feelings, perceptions, formative predispositions, or consciousness.

source: ཤེས་པ་དེ་གཟུགས་ནས་རྣམ་པར་ཤེས་པའི་བར་གྱི་ཕྱི་རོལ་དུ་ཡང་དག་པར་རྗེས་སུ་མ་མཐོང་། ཤེས་པ་དེ་གཟུགས་ནས་རྣམ་པར་ཤེས་པའི་བར་གྱི་ནང་དང་། ཕྱི་རོལ་དུ་ཡང་དག་པར་རྗེས་སུ་མ་མཐོང་།
en: He did not consider that understanding to be outside physical forms, nor [outside the other aggregates], up to and including consciousness.

source: གཟུགས་ལས་གཞན་དུ་ཤེས་པ་དེ་ཡང་དག་པར་རྗེས་སུ་མ་མཐོང་།
en: He did not consider that understanding to be anything other than physical forms.

source: ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་རྣམས་ལས་གཞན་དུ་ཡང་དག་པར་རྗེས་སུ་མ་མཐོང་། ཤེས་པ་དེ་རྣམ་པར་ཤེས་པ་ལས་གཞན་དུ་ཡང་དག་པར་རྗེས་སུ་མ་མཐོང་བའི་སླད་དུའོ། །
en: He did not consider it to be anything other than feelings, perceptions, formative predispositions, and consciousness.

source: རྣམ་གྲངས་འདི་ལ་ཀུན་ཏུ་རྒྱུ་བཟོ་སྦྱངས་མོས་པར་གྱུར་ཏེ། དེ་ཆོས་འདི་ལ་མོས་ནས་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ལ་དད་པས་རྗེས་སུ་འབྲང་བར་གྱུར་ཏོ། །དེ་ལྟ་བས་ན་ཆོས་ཐམས་ཅད་མི་དམིགས་པའི་སླད་དུ་ཆོས་ཉིད་ཚད་མར་བགྱིས་ནས། མཚན་མ་ཡིད་ལ་མི་བགྱིད་པས་ཅི་ནས་ཀྱང་དེས་ཆོས་གང་ཡང་ཡོངས་སུ་གཟུང་བ་མ་མཆིས་པ་དེ་ལྟར་མོས་ལགས་སོ། །
en: In this manner, the wandering mendicant Śreṇika resolved that, intent on this sacred doctrine, he would become a follower with faith in the understanding of all phenomena, and that, owing his non-apprehension of all things, he would appropriate nothing at all, since he had taken reality as his standard and was not attentive to indications.

source: ཆོས་ཐམས་ཅད་ཡོངས་སུ་གཟུང་བ་མ་མཆིས་པའི་སླད་དུ་དེས་གང་གཟུང་བར་བགྱི་བའམ།
en: Inasmuch as all things cannot be appropriated, he did not apprehend anything that he might have grasped or anything that he might have relinquished.

source: གཏང་བར་བགྱི་བའི་ཆོས་གང་ཡང་མ་དམིགས་ཏེ། ཆོས་ཐམས་ཅད་རློམ་སེམས་མ་མཆིས་པའི་སླད་དུ། དེ་མྱ་ངན་ལས་འདས་པས་ཀྱང་རློམ་སེམས་སུ་མི་བགྱིད་ལགས་སོ། །
en: Since he did not make assumptions about anything, he did not make assumptions even on the basis of nirvāṇa.

source: བཙུན་པ་བཅོམ་ལྡན་འདས་ཆོས་ཐམས་ཅད་ཡོངས་སུ་གཟུང་བ་མ་མཆིས་པའི་སླད་དུ།
en: “Reverend Lord!

source: གང་གཟུགས་ཡོངས་སུ་མི་འཛིན་ཅིང་། དེ་བཞིན་དུ་ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་རྣམས་དང་། རྣམ་པར་ཤེས་པ་ཡོངས་སུ་མི་འཛིན་པ་དང་།
en: Owing to the non-appropriation of all things, [bodhisattvas] do not grasp physical forms, and similarly, they do not grasp feelings, perceptions, formative predispositions, and consciousness.

source: དེ་བཞིན་དུ་སྦྱར་ཏེ། ཆོས་ཐམས་ཅད་ཡོངས་སུ་གཟུང་བ་མ་མཆིས་པའི་སླད་དུ་གཟུངས་ཀྱི་སྒོ་ཐམས་ཅད་དང་། ཏིང་ངེ་འཛིན་གྱི་སྒོ་ཐམས་ཅད་ཀྱི་བར་དུ་ཡོངས་སུ་མི་འཛིན་པ་ནི།
en: In the same vein, owing to the non-appropriation of all things, they do not grasp all the gateways of dhāraṇī and [other meditative attributes], up to and including the gateways of meditative stability.

source: ཕ་རོལ་ནས་ཕ་རོལ་དུ་འཆི་བ་མ་མཆིས་པའི་སླད་དུ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་འདིས་ཀྱང་རློམ་སེམས་སུ་མི་བགྱིད་ལགས་སོ། །
en: Owing to the non-existence of transmigration from one world to another at the time of death, they do not make assumptions even on account of this transcendent perfection of wisdom.

source: དེ་ནི་དྲན་པ་ཉེ་བར་གཞག་པ་བཞི་ནས། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པའི་བར་དང་། དེ་བཞིན་དུ་དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་ནས། སངས་རྒྱས་ཀྱི་ཆོས་སམ་འདྲེས་པ་བཅྭ་བརྒྱད་ཀྱི་བར་དག་ཡོངས་སུ་མ་རྫོགས་པར་བར་མ་དོར་ཡོངས་སུ་མྱ་ངན་ལས་མི་འདའ་ལགས་སོ། །
en: Without having perfected [the causal attributes], from the four applications of mindfulness up to the noble eightfold path, and [the fruitional attributes], from the ten powers of the tathāgatas up to the eighteen distinct qualities of the buddhas, they will not pass into final nirvāṇa prematurely.

source: དེ་ཅིའི་སླད་དུ་ཞེ་ན། འདི་ལྟར་དྲན་པ་ཉེ་བར་གཞག་པ་དེ་དག་དྲན་པ་ཉེ་བར་གཞག་པ་མ་ལགས་པར་ཡང་དག་པར་རྗེས་སུ་མཐོང་བ་ནས། དེ་བཞིན་དུ་སྦྱར་ཏེ། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭ་བརྒྱད་ཀྱི་བར་དག་སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་མ་ལགས་པར་ཡང་དག་པར་རྗེས་སུ་མཐོང་བའི་སླད་དུ་སྟེ། འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་གང་གཟུགས་ཡོངས་སུ་མི་འཛིན་པ་དང་། དེ་བཞིན་དུ་ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་རྣམས་དང་། རྣམ་པར་ཤེས་པ་ཡོངས་སུ་མི་འཛིན་པ་ནས་དེ་བཞིན་དུ་སྦྱར་ཏེ། གཟུངས་ཀྱི་སྒོ་ཐམས་ཅད་དང་།
en: If one were to ask why, it is because they consider that those applications of mindfulness are not applications of mindfulness, and in the same vein because they consider that [all the other causal and fruitional attributes], up to and including the eighteen distinct qualities of the buddhas, are not the eighteen distinct qualities of the buddhas [and the rest].

source: ཏིང་ངེ་འཛིན་གྱི་སྒོ་ཐམས་ཅད་ཀྱི་བར་དུ་ཡོངས་སུ་མི་འཛིན་པ་དང་། དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་ནས། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པའི་བར་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་དེ་བཞིན་དུ་སྦྱར་ཏེ། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭ་བརྒྱད་ཀྱི་བར་དག་ཡོངས་སུ་མི་འཛིན་པའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལགས་སོ། །
en: This is the transcendent perfection of wisdom characterized by the non-appropriation of physical forms, possessed by great bodhisattva beings, and similarly the non-appropriation of feelings, perceptions, formative predispositions, and consciousness, and so on, up to the non-appropriation of the dhāraṇī gateways and the gateways of meditative stability, and so on, from the non-appropriation of the applications of mindfulness up to the noble eightfold path, and, in the same vein, from the ten powers of the tathāgatas up to the eighteen distinct qualities of the buddhas.

source: བཙུན་པ་བཅོམ་ལྡན་འདས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པས་འདི་ལྟར་ཉེ་བར་བརྟག་པར་བགྱི་སྟེ། ཀྱེ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་འདི་ནི་གང་། གང་གིས་ན་འདི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡིན། འདི་གང་གི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡིན། དེ་ཅིའི་ཕྱིར་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཞེས་བརྟག་པར་བགྱི་སྟེ།
en: “Moreover, Reverend Lord, great bodhisattva beings who practice the transcendent perfection of wisdom should investigate: ‘What is this transcendent perfection of wisdom, whereby is this transcendent perfection of wisdom, whose is this transcendent perfection of wisdom, and for what purpose is this transcendent perfection of wisdom?’

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པ་ན་ཡང་འདི་སྙམ་དུ་ཆོས་གང་ཡང་མེད་ཅིང་མི་དམིགས་པ་དེ་ནི། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ་སྙམ་དུ་ངེས་པར་སེམས་པར་བགྱིད་དོ། །
en: When great bodhisattva beings practice the transcendent perfection of wisdom, they should determine that the non-existence and non-apprehension of anything at all denote the transcendent perfection of wisdom.”

source: དེ་ནས་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུས། ཚེ་དང་ལྡན་པ་རབ་འབྱོར་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ཚེ་དང་ལྡན་པ་རབ་འབྱོར་ཆོས་མེད་ཅིང་མི་དམིགས་པ་གང་ཡིན། སྨྲས་པ། ནང་སྟོང་པ་ཉིད་ཀྱི་ཕྱིར་དང་། ཕྱི་སྟོང་པ་ཉིད་ཀྱི་ཕྱིར་དང་། ཕྱི་ནང་སྟོང་པ་ཉིད་ཀྱི་ཕྱིར་དང་། སྟོང་པ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་ཕྱིར་དང་། ཆེན་པོ་སྟོང་པ་ཉིད་ཀྱི་ཕྱིར་དང་། དོན་དམ་པ་སྟོང་པ་ཉིད་ཀྱི་ཕྱིར་དང་། འདུས་བྱས་སྟོང་པ་ཉིད་ཀྱི་ཕྱིར་དང་། འདུས་མ་བྱས་སྟོང་པ་ཉིད་ཀྱི་ཕྱིར་དང་། མཐའ་ལས་འདས་པ་སྟོང་པ་ཉིད་ཀྱི་ཕྱིར་དང་། ཐོག་མ་དང་ཐ་མ་མེད་པ་སྟོང་པ་ཉིད་ཀྱི་ཕྱིར་དང་། དོར་བ་མེད་པ་སྟོང་པ་ཉིད་ཀྱི་ཕྱིར་དང་། རང་བཞིན་གྱིས་སྟོང་པ་ཉིད་ཀྱི་ཕྱིར་དང་། རང་གི་མཚན་ཉིད་སྟོང་པ་ཉིད་ཀྱི་ཕྱིར་དང་། ཆོས་ཐམས་ཅད་སྟོང་པ་ཉིད་ཀྱི་ཕྱིར་དང་།
en: Then, the venerable Śāradvatī­putra addressed the venerable Su­bhūti as follows: “Venerable Su­bhūti, what are the things that do not exist and that are non-apprehensible?”

source: མི་དམིགས་པ་སྟོང་པ་ཉིད་ཀྱི་ཕྱིར་དང་། དངོས་པོ་མེད་པ་སྟོང་པ་ཉིད་ཀྱི་ཕྱིར་དང་། ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་ཕྱིར་དང་། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་ཕྱིར། ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་ཆོས་ནི་མེད་ཅིང་མི་དམིགས་སོ། །དེ་བཞིན་དུ་སྦྱར་ཏེ།
en: He replied, “Venerable Śāradvatī­putra, it is owing to the emptiness of internal phenomena, owing to the emptiness of external phenomena, owing to the emptiness of both external and internal phenomena, owing to the emptiness of emptiness, owing to the emptiness of great extent, owing to the emptiness of ultimate reality, owing to the emptiness of conditioned phenomena, owing to the emptiness of unconditioned phenomena, owing to the emptiness of the unlimited, owing to the emptiness of that which has neither beginning nor end, owing to the emptiness of that which is not be to abandoned, owing to the emptiness of inherent existence, owing to the emptiness of all intrinsic defining characteristics, owing to the emptiness of all things, owing to the emptiness of non-apprehension, owing to the emptiness of non-entities, owing to the emptiness of essential nature, and owing to the emptiness of the essential nature of non-entities, that the things associated with the transcendent perfection of wisdom are non-existent, and non-apprehensible.

source: བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་ཆོས་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་ཆོས་དང་། ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་དེ་བཞིན་དུ་བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་ཆོས་ནི་མེད་ཅིང་མི་དམིགས་སོ། །
en: In the same vein, the things associated with the transcendent perfection of meditative concentration, the things associated with the transcendent perfection of perseverance, and similarly, Venerable Śāradvatī­putra, the things associated with the transcendent perfection of tolerance, the things associated with the transcendent perfection of ethical discipline, and the things associated with the transcendent perfection of generosity are non-existent and non-apprehensible.

source: ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་ནང་སྟོང་པ་ཉིད་ཀྱི་ཕྱིར་དང་། དེ་བཞིན་དུ་སྦྱར་ཏེ། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་གྱི་ཕྱིར་གཟུགས་མེད་ཅིང་མི་དམིགས་སོ། །
en: “Moreover, Venerable Śāradvatī­putra, it is owing to the emptiness of internal phenomena, and similarly, owing to the other aspects of emptiness, up to and including the emptiness of the essential nature of non-entities, that physical forms are non-existent and non-apprehensible.

source: ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་དེ་བཞིན་དུ་ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་རྣམས་དང་། རྣམ་པར་ཤེས་པ་མེད་ཅིང་མི་དམིགས་སོ། །
en: Similarly, Venerable Śāradvatī­putra, feelings, perceptions, formative predispositions, and consciousness are also non-existent and non-apprehensible.

source: ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་ནང་སྟོང་པ་ཉིད་ཀྱང་མེད་ཅིང་མི་དམིགས་སོ། །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་དེ་བཞིན་དུ་སྦྱར་ཏེ། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་དུ་མེད་ཅིང་མི་དམིགས་སོ། །
en: Venerable Śāradvatī­putra, even the emptiness of internal phenomena is non-existent and non-apprehensible, and in the same vein, Venerable Śāradvatī­putra, the other aspects of emptiness, up to and including the emptiness of the essential nature of non-entities, are non-existent and non-apprehensible.

source: ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་མེད་ཅིང་མི་དམིགས་སོ། །
en: Venerable Śāradvatī­putra, the applications of mindfulness are non-existent and non-apprehensible.

source: དེ་བཞིན་དུ་སྦྱར་ཏེ། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པའི་བར་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་ནས་སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭ་བརྒྱད་ཀྱི་བར་དུ་མེད་ཅིང་མི་དམིགས་སོ། །
en: In the same vein, [the other causal attributes], up to and including the noble eightfold path, and [the fruitional attributes], from the ten powers of the tathāgatas up to and including the eighteen distinct qualities of the buddhas, are non-existent and non-apprehensible.

source: ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་མངོན་པར་ཤེས་པ་དྲུག་མེད་ཅིང་མི་དམིགས་སོ། །
en: Venerable Śāradvatī­putra, the six extrasensory powers are non-existent and non-apprehensible.

source: དེ་བཞིན་ཉིད་མེད་ཅིང་མི་དམིགས་སོ། །
en: The real nature is non-existent and non-apprehensible.

source: ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་ཆོས་རྣམས་ཀྱི་ཆོས་ཉིད་དང་། ཆོས་གནས་པ་ཉིད་དང་། ཆོས་སྐྱོན་མེད་པ་ཉིད་དང་། ཡང་དག་པའི་མཐའི་བར་དུ་མེད་ཅིང་མི་དམིགས་སོ། །
en: Venerable Śāradvatī­putra, the reality of phenomena, the abiding nature of phenomena, the maturity of all things and [other unconditioned phenomena], up to and including the finality of existence, are non-existent and non-apprehensible.

source: རྒྱུན་དུ་ཞུགས་པ་མེད་ཅིང་མི་དམིགས་པ་ནས། དགྲ་བཅོམ་པའི་བར་དུ་མེད་ཅིང་མི་དམིགས་སོ། །
en: Entering the stream is non-existent and non-apprehensible, and the same goes for [the other fruits], up to and including arhatship, which are non-existent and non-apprehensible.

source: རང་སངས་རྒྱས་མེད་ཅིང་མི་དམིགས་སོ། །
en: The pratyekabuddhas are non-existent and non-apprehensible.

source: བྱང་ཆུབ་སེམས་དཔའ་མེད་ཅིང་མི་དམིགས་སོ། །
en: The bodhisattvas are non-existent and non-apprehensible.

source: ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་སངས་རྒྱས་ཞེས་བྱ་བ་མེད་ཅིང་མི་དམིགས་སོ། །
en: Venerable Śāradvatī­putra, the buddhas are non-existent and non-apprehensible.

source: ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱང་མེད་ཅིང་མི་དམིགས་སོ། །
en: Venerable Śāradvatī­putra, even omniscience is non-existent and non-apprehensible.

source: ཤ་ར་དྭ་ཏིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པ་ན། དེ་ལྟར་ཉེ་བར་རྟོག་པར་བྱེད་ཅིང་ངེས་པར་སེམས་པར་བྱེད་ལ།
en: “Śāradvatī­putra, when great bodhisattva beings practice the transcendent perfection of wisdom, they should investigate and make their determination accordingly.

source: དེ་ལྟར་ཉེ་བར་རྟོག་པར་བྱེད་ཅིང་། དེ་ལྟར་ངེས་པར་སེམས་པ་ན། གལ་ཏེ་སེམས་མི་ཞུམ་མི་འགོང་ལ་མི་སྐྲག་མི་དངང་ཞིང་དངང་བར་མི་འགྱུར་ན། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་མ་བྲལ་བར་རིག་པར་བྱའོ། །
en: When they investigate and make their determination in that manner, if they are not disheartened, if they are not intimidated, if they are not afraid, if they are not terrified, and if they will not be terrified, one should know that these great bodhisattva beings will never be separated from the transcendent perfection of wisdom.”

source: དེ་ནས་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུས། ཚེ་དང་ལྡན་པ་རབ་འབྱོར་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ཚེ་དང་ལྡན་པ་རབ་འབྱོར་ཅིའི་ཕྱིར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་མ་བྲལ་བར་རིག་པར་བྱའོ། །
en: Then, the venerable Śāradvatī­putra addressed the venerable Su­bhūti as follows: “Venerable Su­bhūti, why should one know that these great bodhisattva beings will never be separated from the transcendent perfection of wisdom?”

source: དེ་སྐད་ཅེས་སྨྲས་པ་དང་། ཚེ་དང་ལྡན་པ་རབ་འབྱོར་གྱིས་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་གཟུགས་ནི་གཟུགས་ཀྱི་རང་བཞིན་དང་བྲལ་བ་སྟེ། དེ་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པ་ན། ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་སོ། །
en: The venerable Su­bhūti then replied to the venerable Śāradvatī­putra as follows: “Venerable Śāradvatī­putra, physical forms are without the nature of physical forms, and this is correctly and definitively cognized when great bodhisattva beings practice the transcendent perfection of wisdom.

source: ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་དེ་བཞིན་དུ་ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་རྣམས་དང་། རྣམ་པར་ཤེས་པ་ནི་རྣམ་པར་ཤེས་པའི་རང་བཞིན་དང་བྲལ་བ་སྟེ། དེ་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པ་ན། ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་སོ། །
en: Similarly, Venerable Śāradvatī­putra, feelings, perceptions, formative predispositions, and consciousness are without the nature of consciousness [and the other aggregates], and this is correctly and definitively cognized when great bodhisattva beings practice the transcendent perfection of wisdom.

source: ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་དེ་བཞིན་དུ་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་རང་བཞིན་དང་བྲལ་བ་སྟེ། དེ་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་སོ། །
en: Similarly, Venerable Śāradvatī­putra, the transcendent perfection of generosity, the transcendent perfection of ethical discipline, the transcendent perfection of tolerance, the transcendent perfection of perseverance, the transcendent perfection of meditative concentration, and the transcendent perfection of wisdom are without the nature of the transcendent perfection of wisdom [and the other transcendent perfections], and this is correctly and definitively cognized by great bodhisattva beings.

source: དེ་བཞིན་དུ་སྦྱར་ཏེ། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭ་བརྒྱད་ཀྱི་བར་དང་། ཡང་དག་པའི་མཐའི་བར་ནི་ཡང་དག་པའི་མཐའི་རང་བཞིན་དང་བྲལ་བ་སྟེ། དེ་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པ་ན་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་སོ། །
en: In the same vein, [the fruitional attributes], up to and including the eighteen distinct qualities of the buddhas, and [the unconditioned phenomena], up to and including the finality of existence, are without the nature of the finality of existence [and the aforementioned], and this is correctly and definitively cognized when great bodhisattva beings practice the transcendent perfection of wisdom.

source: ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་རྒྱུ་དེས་ན། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་མ་བྲལ་བར་རིག་པར་བྱའོ། །
en: Venerable Śāradvatī­putra, it is for this reason that one should know great bodhisattva beings to be never separated from the transcendent perfection of wisdom.”
